<?php

declare(strict_types=1);

return [
    'created' => 'Пользователь создан',
    'not_created' => 'Регистрация пользователя не удалась. Попробуйте еще раз',
    'not_found' => 'Пользователь не найден',
    'deleted' => 'Пользователь удален',
    'not_deleted' => 'Не удалось удалить пользователя',
    'not_updated' => 'Не удалось обновить пользователя',
    'updated_with_email' => 'Пользователь обновлён. Письмо с подтверждением email было отправлено',
    'updated' => 'Пользователь обновлён',
    'no_email_verification' => 'Вы не можете войти в аккаунт, пока не подтвердите email',
    'blocked_comment_head' => 'Комментарий',
    'blocked_until' => 'До конца блокировки',
    'blocked' => 'Ваш аккаунт заблокирован',
];
