{
  "Too Many Attempts.": "Вы делаете слишком много запрос к серверу",
  "All rights reserved.": "Все права защищены.",
  "If you're having trouble clicking the \":actionText\" button, copy and paste the URL below\ninto your web browser:": "Если у вас возникли трудности с нажатием кнопки \":actionText\", то скопируйте ссылку ниже и вставьте ее в поисковую строку браузера",
  "PASETO is very pedantic about versions. If you're getting this message, you were insufficiently pedantic in how you called this feature.": "Название версии не валидно",
  "The length of the JSON-encoded claim sis longer than the Parser is configured to accept.": "JSON строка слишком длинная",
  "The number of object keys in the JSON-encoded claims exceeds the configured limit. This may be a Hash-DoS attempt, but it's most likely a misconfiguration.": "Неверное количество ключей в JSON строке",
  "This JSON-encoded claims has too much recursive depth.": "JSON строка имеет слишком большую вложенность",
  "A JSON error occurred when JSON-serializing or deserializing the footer.": "Ошибка сериализации или десериализации JSON - footer",
  "We were expecting a different footer than the payload contained.": "Paseto footer похож на полезную нагрузку",
  "At some point, HKDF was called incorrectly. This shouldn't ever happen in practice. Make sure your copy of this library imported correctly.": "Библиотека HKDF была импортированна с ошибкой",
  "A JSON error occurred when JSON-serializing or deserializing the Implicit Assertions.": "Ошибка сериализации или десериализации JSON - неявные утверждения",
  "Implicit Assertions are only a part of Version 3 and Version 4. This feature is explicitly not permitted in older versions to ensure backwards compatibility.": "Вы используете старую версию paseto и поэтому невозможно использовать неявные утверждения",
  "An error occurred when attempting to decode what we expected to be a base64url-encoded string. This usually implies invalid data was passed to this method. Check that you're passing data correctly.": "Строка должна быть в base64 формате",
  "The header did not match what was expected. Make sure you're passing the right token to the right methods.": "Заголовок с токеном не валиден",
  "When attempting to calculate the recursive depth of the JSON payload, we arrived at an invalid state. This usually happens when there aren't an equal number of open brackets and close brackets, or they're not in the proper sequence.This *may* be an attempt to attack the JSON parser library (i.e. stack overflow), but we detected and prevented this invalid data from reaching the JSON parser.": "JSON строка не валидна. Возможно вы пытаетесь переполнить стек",
  "The message authentication code provided with this message did not match the one we calculated.": "Невалидный код аутентификации",
  "A condition we thought impossible has occurred.": "Получено невозможное состояние. Обратитесь в техническую поддержку с подробным описанием получения данной ошибки",
  "The raw() method was invoked on a SendingKeyMap or ReceivingKeyMap object, instead of the actual key. This is an error. Invoke fetch() to get the underling key and pass that instead.": "Вы вызвали raw(), а нужно было fetch()",
  "The key you requested is not in this keyring.": "Невалидный ключ аутентификации",
  "An expected property was not defined at runtime.": "Ожидаемое свойство не было определено во время выполнения при проверке токена аутентификации",
  "The received PASETO was too short to be valid.": "Paseto токен слишком короткий",
  "The PASETO protocol version you specified was deprecated and then removed from this library.": "Вы вызываете слишком старую версию Paseto",
  "Unknown error code": "Прилетело НЛО и показало это ошибку",
  "This token has expired.": "Истек срок хранения токена авторизации. Вы вышли из аккаунта!",
  "An error occurred": "Произошла ошибка при проверке токена авторизации"
}
